-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 27, 2025 at 06:23 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `news`
--

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `news_id` int(11) NOT NULL,
  `news_title` varchar(255) NOT NULL,
  `news_text` text NOT NULL,
  `news_date` timestamp NOT NULL DEFAULT current_timestamp(),
  `news_image` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`news_id`, `news_title`, `news_text`, `news_date`, `news_image`) VALUES
(21, 'hello world my name is luka', 'სსიპ კოლეჯი „ინფორმაციული ტექნოლოგიების აკადემია“ ფუნქციონირებს 2007 წლიდან. სწავლება ხორციელდება სამი მიმართულებით: ჩარჩო დოკუმენტის საფუძველზე შემუშავებული (მოდულური) პროგრამები, მოკლევადიანი ტრენინგ-კურსები და ზრდასრულთა პროფესიული მომზადების პროგრამები. კოლეჯის დაარსებიდან 2021 წლამდე აღნიშნული პროგრამები და კურსები გაიარა ათასობით სპეციალისტმა. ბიზნეს სექტორთან მჭიდრო პარტნიორობამ სტუდენტებს საშუალება მისცა გაიარონ სრულყოფილი საწარმოო პრაქტიკა, სტაჟირება და ჩამოყალიბდნენ კონკურენტუნარიან სპეციალისტებად. 2023 წლის დასაქმების მაჩვენებელი 96%-ია\r\nსსიპ კოლეჯი „ინფორმაციული ტექნოლოგიების აკადემია“ ფუნქციონირებს 2007 წლიდან. სწავლება ხორციელდება სამი მიმართულებით: ჩარჩო დოკუმენტის საფუძველზე შემუშავებული (მოდულური) პროგრამები, მოკლევადიანი ტრენინგ-კურსები და ზრდასრულთა პროფესიული მომზადების პროგრამები. კოლეჯის დაარსებიდან 2021 წლამდე აღნიშნული პროგრამები და კურსები გაიარა ათასობით სპეციალისტმა. ბიზნეს სექტორთან მჭიდრო პარტნიორობამ სტუდენტებს საშუალება მისცა გაიარონ სრულყოფილი საწარმოო პრაქტიკა, სტაჟირება და ჩამოყალიბდნენ კონკურენტუნარიან სპეციალისტებად. 2023 წლის დასაქმების მაჩვენებელი 96%-იასსიპ კოლეჯი „ინფორმაციული ტექნოლოგიების აკადემია“ ფუნქციონირებს 2007 წლიდან. სწავლება ხორციელდება სამი მიმართულებით: ჩარჩო დოკუმენტის საფუძველზე შემუშავებული (მოდულური) პროგრამები, მოკლევადიანი ტრენინგ-კურსები და ზრდასრულთა პროფესიული მომზადების პროგრამები. კოლეჯის დაარსებიდან 2021 წლამდე აღნიშნული პროგრამები და კურსები გაიარა ათასობით სპეციალისტმა. ბიზნეს სექტორთან მჭიდრო პარტნიორობამ სტუდენტებს საშუალება მისცა გაიარონ სრულყოფილი საწარმოო პრაქტიკა, სტაჟირება და ჩამოყალიბდნენ კონკურენტუნარიან სპეციალისტებად. 2023 წლის დასაქმების მაჩვენებელი 96%-იასსიპ კოლეჯი „ინფორმაციული ტექნოლოგიების აკადემია“ ფუნქციონირებს 2007 წლიდან. სწავლება ხორციელდება სამი მიმართულებით: ჩარჩო დოკუმენტის საფუძველზე შემუშავებული (მოდულური) პროგრამები, მოკლევადიანი ტრენინგ-კურსები და ზრდასრულთა პროფესიული მომზადების პროგრამები. კოლეჯის დაარსებიდან 2021 წლამდე აღნიშნული პროგრამები და კურსები გაიარა ათასობით სპეციალისტმა. ბიზნეს სექტორთან მჭიდრო პარტნიორობამ სტუდენტებს საშუალება მისცა გაიარონ სრულყოფილი საწარმოო პრაქტიკა, სტაჟირება და ჩამოყალიბდნენ კონკურენტუნარიან სპეციალისტებად. 2023 წლის დასაქმების მაჩვენებელი 96%-ია', '2025-04-27 15:46:10', 'images/img8.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`news_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `news_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
